ontwikkel_nvwa/gegenereerd_updatebericht.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://ec.europa.eu/sanco/tracesnt/base/v4" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:v1="http://ec.europa.eu/tracesnt/referencedata/v1">
    <soapenv:Header xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Security>
            <wsse:UsernameToken wsu:Id="UsernameToken-A5B8D7123A55CB6A75153751937547586">
                <wsse:Username>n0039qig</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">+GYwQWMjW39d7+PtMDEgsOeOa4g=</wsse:Password>
                <wsse:Nonce>UmxsekxEWnhOVG9QZ25YdA==</wsse:Nonce>
                <wsu:Created>2022-11-22T16:26:20.261Z</wsu:Created>
            </wsse:UsernameToken>
            <wsu:Timestamp>
                <wsu:Created>2022-11-22T16:26:20.261Z</wsu:Created>
                <wsu:Expires>2022-03-01T00:00:00.000+02:00</wsu:Expires>
            </wsu:Timestamp>
        </wsse:Security>
        <v4:LanguageCode>nl</v4:LanguageCode>
        <v4:WebServiceClientId>vgc-client</v4:WebServiceClientId>
    </soapenv:Header>
    <soapenv:Body>
        <v1:GetClassificationTreeUpdatesRequest>
            <v1:TreeID>chedp</v1:TreeID>
            <v1:UpdateDateTimeRange>
                <v4:From>2022-02-01T00:00:00.000+02:00</v4:From>
                <v4:To>2022-11-22T16:26:20.261Z</v4:To>
            </v1:UpdateDateTimeRange>
        </v1:GetClassificationTreeUpdatesRequest>
    </soapenv:Body>
</soapenv:Envelope>